#Параметры стола
center = (400, 1148)
radius = [370, 260, 150, 50]
num_sectors = 22

#Настройки приоритетов закатывания 
normal_priority = [[2,2,2,2,4,1,4,2,2,2,2,
                    1,1,1,1,0,0,0,1,1,1,1],
                   [7,7,7,8,8,8,8,8,7,7,7,
                    6,6,6,7,7,9,7,7,6,6,6]]

#Настройки приоритетов выбивания fast и destroy 
fast_priority = [[2,2,2,2,1,1,1,2,2,2,2,
                  2,2,2,3,4,8,4,3,2,2,2],
                [10,10,10,10,10,10,10,10,10,10,10,
                 10,10,10,10,10,10,10,10,10,10,10]]

#Возможность выключить некотоыре секторы из расчета (1-on, 0-off)
embedded_sectors =    [[1,1,1,1,1,1,1,1,1,1,1,
                        1,1,1,1,1,1,1,1,1,1,1],
                       [1,1,1,1,1,1,1,1,1,1,1,
                        1,1,1,1,1,1,1,1,1,1,1]]

#Настройки ограничений бросков 
min_x = 150 
max_x = 650 
step = 25 
start_y = 20 
safe_distance = 120